---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerKey.Dispose
source: html/2498f317-51a6-56a4-d84a-8652eb617027.htm
---
# Autodesk.Revit.DB.ExportLayerKey.Dispose Method

Releases all resources used by the ExportLayerKey

## Syntax (C#)
```csharp
public void Dispose()
```